<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"4717e4a04767eb7d684288154c05c7195de27b012fad637607dd6c24c3986f1d","plan_job_ref":"Job Create MPE Management terraform plan #64 at https://github.com/AFMPE/mpe_management/actions/runs/4834065166","plan_hash":"1dbd7736fdbe09b1f88def79e471291fe71a1f28a8d35c18cafc3b9d4427dcf0","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __src__
With backend config: `storage_account_name=afmpetfmgtprodh8dc4qua
container_name=core-mgt-prod-tfstate            
resource_group_name=afmpe-network-artifacts-rg
`
With var files: `src/tfvars/production/parameters.prod.tfvars
`<details open><summary>With variables</summary>

```hcl
state_sa_container_name           = (sensitive value)
state_sa_name                     = (sensitive value)
state_sa_rg                       = (sensitive value)
subscription_id_hub               = (sensitive value)
subscription_id_internal          = (sensitive value)
subscription_id_partners_gsa_dev  = (sensitive value)
subscription_id_partners_gsa_prod = (sensitive value)
subscription_id_sandbox           = (sensitive value)
```
</details>
<details>
<summary>Plan: 2 to add, 2 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.mod_sentinel_rule_alerts.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_alert_rule_scheduled.sentinel_alert["AAD_No_Password_Expiry"] will be created
  + resource "azurerm_sentinel_alert_rule_scheduled" "sentinel_alert" {
      + display_name               = "AAD_No_Password_Expiry"
      + enabled                    = true
      + id                         = (known after apply)
      + log_analytics_workspace_id = "******************************************************************************************************************************************************************************************"
      + name                       = "AAD_No_Password_Expiry"
      + query                      = <<-EOT
            union isfuzzy=true 
                  (
                  SecurityEvent
                  | where EventID == 4738
                  // 2089 value indicates the Don't Expire Password value has been set
                  | where UserAccountControl has "%%2089" 
                  | extend Value_2089 = iff(UserAccountControl has "%%2089","'Don't Expire Password' - Enabled", "Not Changed")
                  // 2050 indicates that the Password Not Required value is NOT set, this often shows up at the same time as a 2089 and is the recommended value.  This value may not be in the event. 
                  | extend Value_2050 = iff(UserAccountControl has "%%2050","'Password Not Required' - Disabled", "Not Changed")
                  // If value %%2082 is present in the 4738 event, this indicates the account has been configured to logon WITHOUT a password. Generally you should only see this value when an account is created and only in Event 4720: Account Creation Event.  
                  | extend Value_2082 = iff(UserAccountControl has "%%2082","'Password Not Required' - Enabled", "Not Changed")
                  | project StartTime = TimeGenerated, EventID, Activity, Computer, TargetAccount, TargetSid, AccountType, UserAccountControl, Value_2089, Value_2050, Value_2082, SubjectAccount
                  | extend timestamp = StartTime, AccountCustomEntity = TargetAccount, HostCustomEntity = Computer
                  ),
                  (
                  WindowsEvent
                  | where EventID == 4738 and EventData has '2089'
                  // 2089 value indicates the Don't Expire Password value has been set
                  | extend UserAccountControl = tostring(EventData.UserAccountControl)
                  | where UserAccountControl has "%%2089" 
                  | extend Value_2089 = iff(UserAccountControl has "%%2089","'Don't Expire Password' - Enabled", "Not Changed")
                  // 2050 indicates that the Password Not Required value is NOT set, this often shows up at the same time as a 2089 and is the recommended value.  This value may not be in the event. 
                  | extend Value_2050 = iff(UserAccountControl has "%%2050","'Password Not Required' - Disabled", "Not Changed")
                  // If value %%2082 is present in the 4738 event, this indicates the account has been configured to logon WITHOUT a password. Generally you should only see this value when an account is created and only in Event 4720: Account Creation Event.  
                  | extend Value_2082 = iff(UserAccountControl has "%%2082","'Password Not Required' - Enabled", "Not Changed")
                  | extend Activity="4738 - A user account was changed."
                  | extend TargetAccount = strcat(EventData.TargetDomainName,"\\", EventData.TargetUserName)
                  | extend TargetSid = tostring(EventData.TargetSid)
                  | extend SubjectAccount = strcat(EventData.SubjectDomainName,"\\", EventData.SubjectUserName)
                  | extend SubjectUserSid = tostring(EventData.SubjectUserSid)
                  | extend AccountType=case(SubjectAccount endswith "$" or SubjectUserSid in ("S-1-5-18", "S-1-5-19", "S-1-5-20"), "Machine", isempty(SubjectUserSid), "", "User")
                  | project StartTime = TimeGenerated, EventID, Activity, Computer, TargetAccount, TargetSid, AccountType, UserAccountControl, Value_2089, Value_2050, Value_2082, SubjectAccount
                  | extend timestamp = StartTime, AccountCustomEntity = TargetAccount, HostCustomEntity = Computer
                  )
        EOT
      + query_frequency            = "P3D"
      + query_period               = "P1D"
      + severity                   = "Low"
      + suppression_duration       = "PT5H"
      + suppression_enabled        = true
      + tactics                    = [
          + "Persistence",
        ]
      + techniques                 = [
          + "T1098",
        ]
      + trigger_operator           = "GreaterThan"
      + trigger_threshold          = 0

      + entity_mapping {
          + entity_type = "Account"

          + field_mapping {
              + column_name = "AccountCustomEntity"
              + identifier  = "FullName"
            }
        }
      + entity_mapping {
          + entity_type = "Host"

          + field_mapping {
              + column_name = "HostCustomEntity"
              + identifier  = "FullName"
            }
        }

      + event_grouping {
          + aggregation_method = "SingleAlert"
        }

      + incident_configuration {
          + create_incident = true

          + grouping {
              + enabled                 = true
              + entity_matching_method  = "AllEntities"
              + group_by_alert_details  = [
                  + "Severity",
                ]
              + group_by_entities       = []
              + lookback_duration       = "P1D"
              + reopen_closed_incidents = true
            }
        }
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_data_connector_microsoft_threat_intelligence.dataMTI must be replaced
-/+ resource "azurerm_sentinel_data_connector_microsoft_threat_intelligence" "dataMTI" {
      + bing_safety_phishing_url_lookback_date       = "1970-01-01T00:00:00Z" # forces replacement
      ~ id                                           = "*************************************************************************************************************************************************************************************************************************************************************" -> (known after apply)
        name                                         = "MSTI_Connector"
      ~ tenant_id                                    = "************************************" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["StorageAccounts"] will be updated in-place
  ~ resource "azurerm_security_center_subscription_pricing" "main" {
        id            = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/providers/Microsoft.Security/pricings/StorageAccounts"
      - subplan       = "PerTransaction" -> null
        # (2 unchanged attributes hidden)
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["VirtualMachines"] will be updated in-place
  ~ resource "azurerm_security_center_subscription_pricing" "main" {
        id            = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/providers/Microsoft.Security/pricings/VirtualMachines"
      - subplan       = "P2" -> null
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Create MPE Management terraform plan #64](https://github.com/AFMPE/mpe_management/actions/runs/4834065166)